// Node 是 啥

/*
  node是构建在chrome V8 引擎上的一个JavaScript 运行环境
*/

// node 跟 chrome 有什么区别

/*
  架构一样。都是基于事件驱动的异步架构！

  浏览器主要是通过事件驱动来服务页面交互

  node 主要是通过事件驱动来服务 I/O
  node 没有HTML、WebKit和显卡等等的UI技术支持

``alert()

  console.log()

  CS架构        C表示客户端  S表示服务1

  BS架构        B表示游览器    S表示服务
*/

// Node  版本的 10.X
// 并行表示在同一个时刻点有多少条代码和指令/多少个逻辑正在同时执行
// 并发处理器在某一段时间多少的任务
//如果并发量特别多的时候，叫做高并发
// 进程 线程    1进程  1线程  注意：两者至少要有一个
//进程表示软件在运行中需要这个环境


//cpu 1ms=1000微妙    1微妙=1000纳秒
//1纳秒
//I/O读写操作

//Nodejs

// I/O 密集型  实时应用
// CPU 密集型   比如计算

/*
request() M  10

request() N   5
M+N

10
*/




